Q-15. Write an SQL query to fetch intersecting records of two tables.

In [1]:
import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(host='localhost',
                                         user='root',
                                         password='Am!t@kmr_2$@2')

except Error as e:
    print("Error while connecting to MySQL", e)

In [2]:
if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        #cursor.execute("create database workdatabase;")
        #cursor.execute("use workdatabase;")
        print("You're connected to database: ")

Connected to MySQL Server version  8.0.28
You're connected to database:

In [3]:
cursor.execute ("use workdatabase")

In [4]:
cursor.execute("select a.* from  emp a , dept b where a.deptno=b.deptno;")

In [5]:
cursor.fetchall()

[(7369,
  'SMITH',
  'CLERK',
  7902,
  datetime.date(1993, 6, 13),
  Decimal('800.00'),
  Decimal('0.00'),
  20,
  'SMITH@abc.com'),
 (7499,
  'ALLEN',
  'SALESMAN',
  7698,
  datetime.date(1998, 8, 15),
  Decimal('1600.00'),
  Decimal('300.00'),
  30,
  'ALLEN@abc.com'),
 (7521,
  'WARD',
  'SALESMAN',
  7698,
  datetime.date(1996, 3, 26),
  Decimal('1250.00'),
  Decimal('500.00'),
  30,
  'WARD@abc.com'),
 (7566,
  'JONES',
  'MANAGER',
  7839,
  datetime.date(1995, 10, 31),
  Decimal('2975.00'),
  None,
  20,
  'JONES@abc.com'),
 (7654,
  'MARTIN',
  'SALESMAN',
  7698,
  datetime.date(1998, 12, 5),
  Decimal('1250.00'),
  Decimal('1400.00'),
  30,
  'MARTIN@abc.com'),
 (7698,
  'BLAKE',
  'MANAGER',
  7839,
  datetime.date(1992, 6, 11),
  Decimal('2850.00'),
  None,
  30,
  'BLAKE@abc.com'),
 (7782,
  'CLARK',
  'MANAGER',
  7839,
  datetime.date(1993, 5, 14),
  Decimal('2450.00'),
  None,
  10,
  'CLARK@abc.com'),
 (7788,
  'SCOTT',
  'ANALYST',
  7566,
  datetime.date(1996, 3, 5),
  Decimal('3000.00'),
  None,
  20,
  'SCOTT@abc.com'),
 (7839,
  'KING',
  'PRESIDENT',
  None,
  datetime.date(1990, 6, 9),
  Decimal('5000.00'),
  Decimal('0.00'),
  10,
  'KING@abc.com'),
 (7844,
  'TURNER',
  'SALESMAN',
  7698,
  datetime.date(1995, 6, 4),
  Decimal('1500.00'),
  Decimal('0.00'),
  30,
  'TURNER@abc.com'),
 (7876,
  'ADAMS',
  'CLERK',
  7788,
  datetime.date(1999, 6, 4),
  Decimal('1100.00'),
  None,
  20,
  'ADAMS@abc.com'),
 (7900,
  'JAMES',
  'CLERK',
  7698,
  datetime.date(2000, 6, 23),
  Decimal('950.00'),
  None,
  30,
  'JAMES@abc.com'),
 (7902,
  'FORD',
  'ANALYST',
  7566,
  datetime.date(1997, 12, 5),
  Decimal('3000.00'),
  None,
  20,
  'FORD@abc.com'),
 (7934,
  'MILLER',
  'CLERK',
  7782,
  datetime.date(2000, 1, 21),
  Decimal('1300.00'),
  None,
  10,
  'MILLER@abc.com')]

Q-16. Write an SQL query to show records from one table that another table does not have.

In [8]:
cursor.execute("select A.* from  emp a  where a.deptno NOT IN (SELECT DEPTNO FROM dept);")

In [9]:
cursor.fetchall()

[]

In [10]:
cursor.close()
connection.close()
print("MySQL connection is closed")

MySQL connection is closed